[{"description":"The 12 Factor Pattern is a software methodology for building cloud-friendly (or cloud-native), scalable, maintainable applications that deploy easily on a Platform-as-a-Service (aka PaaS).","term":"12f, 12-factor, 12 factor, 12 factor pattern, 12-factor pattern"},{"description":"Amazon Certificate Manager is a service that lets you easily provision, manage, and deploy TLS certificates for use with AWS services such as ELBs and CloudFront.","term":"ACM, Amazon Certificate Manager"},{"description":"An Amazon Machine Image provides the information required to launch an EC2 instance, which is a virtual server in the Amazon public cloud.","term":"AMI, Amazon Machine Image"},{"description":"Amazon\u0026rsquo;s Systems Manager provides a unified user interface so you can view operational data from multiple AWS services and allows you to automate operational tasks across your AWS resources such as configurations with Parameter Store. Systems Manager simplifies resource and application management, shortens the time to detect and resolve operational problems, and makes it easy to operate and manage your infrastructure securely at scale.","term":"SSM, Systems Manager, Amazon Systems Manager"},{"description":"An anti-pattern is the opposite of a best-practice.","term":"anti pattern, anti patterns, anti-pattern, anti-patterns, bad practice, bad-practice"},{"description":"An Availability Zone is an isolated data center within a geographic region that is interconnected with other AZs through low-latency links.","term":"az, azs, availability zone, availability zones, multi-az, multi-availability zones, multi availability zone"},{"description":"Amazon Web Services is a public cloud offering by Amazon.com","term":"Amazon Web Services, AWS, aws cli, awscli, aws-cli, !aws-"},{"description":"aws-vault is a utility for securely managing secrets with AWS Systems Manager (SSM) Parameter Store and KMS","term":"aws-vault, aws vault"},{"description":"A bastion host is the only host permitted to be directly addressed via SSH from the internet.","term":"bastion, bastion server, kastion, jump host, jumphost, jump-host"},{"description":"A well-understood and often published technique or methodology that, through experience and research, has proven to reliably lead to a desired result.","term":"Best Practice, Best Practices"},{"description":"BeyondCorp is an enterprise security model pioneered by Google that enables every employee to work from untrusted networks without the use of a VPN. One critical component is an Identity Aware Proxy.","term":"BeyondCorp"},{"description":"A build-harness is like a \u0026ldquo;test harness\u0026rdquo;. It provides reusable methods for building and deploying software.","term":"build-harness, build harness"},{"description":"Business Logic is the code that describes real-world business rules that determine how things should work.","term":"BL, B/L, Business Logic, business-logic"},{"description":"Chamber is a tool by Segment IO for managing secrets with AWS SSM+KMS and exposing them as environment variables.","term":"Chamber"},{"description":"A formal process followed in order to make changes in a document, systematic process.","term":"change Management, change control"},{"description":"A Chart Registry is responsible for storing and serving Helm chart packages (.tar.gz) to the helm tiller running in the kubernetes cluster.","term":"chart Registry, chart repository, chart repo"},{"description":"cli is common abbreviation for client and usually refers to some kind of command line tool.","term":"cli, clis"},{"description":"The act of performing systems administration and configuration by pointing and clicking on proprietary tools.","term":"ClickOps, Click Operations"},{"description":"Cloud Posse is a DevOps Accelerator","term":"cloudposse, cloud posse, cloud posse llc, cloud posse, cloudposse, !cloudposse.com, !cloudposse.net, !cloudposse.org"},{"description":"Amazon CloudFront is a content delivery network (CDN) used to improve latency for end users by hosting cacheable content on distributed global edge locations.","term":"CloudFront, Cloud Front, CF"},{"description":"","term":"CloudTrail, Cloud Trail"},{"description":"Amazon CloudWatch is a monitoring service for AWS cloud resources and applications.","term":"CloudWatch, Cloud Watch, AWS CloudWatch"},{"description":"Amazon CloudWatch Logs is a central store for managing logs from AWS cloud resources and applications.","term":"cloudwatch Logs"},{"description":"A process of reviewing Pull Requests to enable collaboration between team members, improves code quality/stability through creation of alternative solutions to problems, increase transparency through proof of work, increases team awareness by involvement, and improves business continuity through knowledge transfer.","term":"Code Review, CR"},{"description":"Amazon CodeBuild is a fully managed build service that compiles source code, runs tests, and produces software packages that are ready to deploy. With CodeBuild, you don’t need to provision, manage, and scale your own build servers.","term":"CodeBuild, Code Build"},{"description":"Amazon CodeDeploy is a service that automates software deployments to AWS cloud resources.","term":"CodeDeploy, Code Deploy"},{"description":"Codefresh is CI/CD as a service, built for containers with native support for Docker, Kubernetes and Helm.","term":"Codefresh, Codefresh"},{"description":"Amazon CodePipeline is a continuous integration and continuous delivery service for fast and reliable application and infrastructure updates.","term":"CodePipeline, Code Pipeline"},{"description":"","term":"CMP, Container Management Platform"},{"description":"A process in which immutable code artifacts (E.g. packages, rpms, images, etc) are shipped to permanent storage and optionally deployed to an environment such as staging or production. This process is usually associated with “Continuous Deployment” or “Automated Deployment”","term":"Continuous Delivery, Continuous Deployment"},{"description":"A process in which code is automatically checked out from version control (e.g. git) and submitted to a battery of automated tests to ensure that the recent changes will not have adverse effects on the code base and product stability.","term":"Continuous Integration"},{"description":"CI/CD is the practice of combining “Continuous Integration” with “Continuous Delivery” (aka “Continuous Deployment”)","term":"CI/CD"},{"description":"CRUD is a frequently used acronym which means Create, Read, Update and Destroy. It refrers to the standard life-cycle events for data manipulation.","term":"CRUD"},{"description":"The declarative approach focuses on the desired outcome, but doesn\u0026rsquo;t expose any method to influence how that outcome is achieved.","term":"declarative, declarative declaration"},{"description":"Docker Compose is a tool for defining and running multi-container Docker applications. Typically used for local development.","term":"docker-compose, docker compose"},{"description":"A docker image is a self-contained, layered archive containing an application and all of its OS dependancies and is the artifact of running a docker build. The image is what gets stored in a docker registry.","term":"docker image, docker images"},{"description":"A Docker registry is a place to store and distribute Docker images.","term":"docker registry, docker registries, docker repository, docker repositories"},{"description":"A Dockerfile is a lightweight DSL that contains all the commands a user could call on the command line to assemble an image in order to run an application.","term":"Dockerfile"},{"description":"DRY is an acronym for \u0026ldquo;Don\u0026rsquo;t Repeat Yourself\u0026rdquo;, which refers to the aim of reducing repetition of software code through copy-and-paste.","term":"dry, d.r.y."},{"description":"","term":"ECS, Elastic Container Service"},{"description":"The ECS Agent is a component of Amazon Elastic Container Service (ECS) and is responsible for managing containers on behalf of Amazon ECS.","term":"ecs agent, ecs-agent"},{"description":"An ECS Service is a specified number (the \u0026ldquo;desired count\u0026rdquo;) of instances of an ECS Task simultaneously running in an Amazon ECS cluster.","term":"ECS service, ecs-service"},{"description":"An ECS Task is a JSON document that describes one or more containers, that form an application. It can be thought of as a blueprint for an application.","term":"ECS Task, ecs-task"},{"description":"Amazon ECR is a fully managed Docker container registry to store, manage, and deploy Docker container images on AWS.","term":"ECR, Elastic Container Registry"},{"description":"Amazon Elastic Beanstalk is an orchestration service offered from AWS for deploying infrastructure which orchestrates various services, including EC2, S3, ELB, SNS, CloudWatch, auto-scaling, auto-healing, and Elastic Load Balancers.","term":"ElasticBeanstalk, Elastic BeanStalk, EB, eb cli, eb-cli"},{"description":"The term end-to-end encompasses an entire workflow from start to finish.","term":"e2e, end to end, end-to-end"},{"description":"An Environment Variable is an an interface provided by nearly every OS to pass configuration information to a process.","term":"env, dotenv, .env"},{"description":"Executable Documentation is documentation that is so actionable you can just execute it directly or run it manually if you so choose.","term":"executable documentation"},{"description":"FUSE stands for Filesystem in Userspace and is an interface that allows developers to implement custom filesystems without requiring complex kernel modules.","term":"fuse"},{"description":"Geodesic is an interactive command-line shell which bundles all essential open source cloud orchestration tools needed administer clusters from the command line. The only dependency is that docker is installed. The tools provided include kops, terraform, eb cli, aws cli, etc","term":"geodesic"},{"description":"A geodesic module is a docker image that extends the geodesic base image and implements functions specific to that stage or account.","term":"geodesic Module"},{"description":"A geodesic shell is an invocation of a geodesic module. Said differently, it\u0026rsquo;s when you run a geodesic docker image and enter into the bash shell.","term":"geodesic shell"},{"description":"A form of Change Control that uses Git as the system of record.","term":"GitHub Workflow, Git Workflow"},{"description":"Goofys is a utility that implements S3-backed filesystems using FUSE.","term":"goofys"},{"description":"HCL is HashiCorp\u0026rsquo;s configuration language used in multiple products, but most notably in terraform.","term":"HCL, HashiCorp Configuration language, HashiCorp Language"},{"description":"HashiCorp Terraform is a tool for building, changing, and versioning infrastructure safely and efficiently. Terraform can manage existing and popular service providers such as AWS as well as custom in-house solutions. Configuration files describe to Terraform the components needed to run a single application or your entire datacenter.","term":"Terraform, HashiCorp Terraform"},{"description":"Helm is one of the predominant package managers for kubernetes which is used for installing applications on the cluster.","term":"helm"},{"description":"A Helm Chart is a package that defines all the kubernetes resources necessary for deploying an application to kubernetes.","term":"helm chart, helm charts, chart, charts"},{"description":"The helm tiller is the server-side component (API) for helm that manages all CRUD operations.","term":"helm tiller, helm-tiller"},{"description":"An Identity-Aware Proxy enables an organization to control access to cloud applications (e.g. SaaS).","term":"iap, Idenity Aware Proxy"},{"description":"Amazon\u0026rsquo;s IAM is a service that helps you securely control access to AWS resources.","term":"IAM, Identity Access Management"},{"description":"The imperative approach focuses on how precisely the infrastructure should be defined.","term":"imperative, imperative declaration, imperative configuration management"},{"description":"Infrastructure is everything that supports running your software","term":"infrastructure, Infrastructure"},{"description":"Infrastructure as Code (IaC) is the process of managing/provisioning Infrastructure as a Service (IaaS) using machine-readable definition files (usually DSLs), rather than rely on humans doing physical/manual hardware configuration.","term":"IaC, Infrastructure as Code, infrastructure-as-code"},{"description":"An Ingress Controller is a native resource type in Kubernetes that functions like a Layer 7 Load Balancer (e.g. HTTP Load Balancer) to route requests to various backend services based on incoming hostname (e.g. Host header) and request path (e.g. /foo).","term":"Ingress, Ingress Controller"},{"description":"The init-terraform script is a helper for configuring and then initializing terraform remote state in combination with the terraform-aws-tfstate-backend module.","term":"init-terraform"},{"description":"jq is a Go-based command line tool for JSON that supports standard CRUD operations.","term":"jq"},{"description":"Kanban is a popular framework used to implement agile software development that leverages cards and boards to visually communicate the status of a project.","term":"Kanban, kanban Board"},{"description":"A managed service that makes it easy for you to create and control the encryption keys used to encrypt your data, and uses FIPS 140-2 validated hardware security modules to protect the security of your keys. A","term":"KMS, Key Management Service"},{"description":"A Key Performance Indicator is a metric (e.g. number of requests per second) that indicates if some key business objective is being satisfied.","term":"kpi, kpis, key performance indicator"},{"description":"kubectl is a command line tool (cli) for running commands against Kubernetes clusters","term":"kubectl"},{"description":"Kubernetes is an open-source system for automating deployment, scaling, and management of containerized applications. It groups containers that make up an application into logical units for easy management and discovery. Kubernetes builds upon 15 years of experience of running production workloads at Google, combined with best-of-breed ideas and practices from the community.","term":"Kubernetes, kube, k8s"},{"description":"Kops ships with geodesic and is the easiest way to get a production grade Kubernetes cluster up and running on AWS.","term":"kops, kubernetes Ops"},{"description":"AWS serverless (functions as a service) offering.","term":"Lambda"},{"description":"The “Application Layer” (e.g. HTTP)","term":"Layer 7, Layer-7, layer7"},{"description":"Monorepo refers to a strategy of storing all code for possibly unrelated applications within the same source code repository.","term":"Monorepo, monorepos, mono-repo, mono-repos, mono repo, mono repos"},{"description":"Multifactor authentication is a security \u0026ldquo;Best Practice\u0026rdquo; of requiring more than one method to verify access credentials during authentication","term":"MFA, MFA Token, Multi-Factor Authentication, Multi Factor Authentication, 2FA, Two Factor, Two-factor, Two Factor Auth, Two-Factor Auth, Two-Factor Authnetication, Two Factor Authentication, OTP, One Time Password"},{"description":"The on-call engineer is the person currently assigned to take-point if any serious issues arise. They are typically the ones on “pager duty” who get a phone call in the middle of the night if/when things break.","term":"oce, oncall engineer, on-call engineer"},{"description":"OSI is a conceptual model consisting of 7 abstraction layers that represent the various functions of a computing system without regard to its underlying internal structure and technology.","term":"OSI, OSI model"},{"description":"An incident management platform that provides reliable incident notifications via email, push, SMS, and phone, as well as automatic escalations, on-call scheduling, and other functionality to help teams detect and fix infrastructure problems quickly.","term":"PagerDuty"},{"description":"The Amazon Systems Manager Parameter Store provides secure, hierarchical storage for configuration data management and secrets management.","term":"Parameter Store, SSM Parameter Store, Amazon SSM Parameter Store"},{"description":"Pingdom is a service that tracks the availability (e.g. uptime \u0026amp; downtime) as well as the performance of websites.","term":"pingdom"},{"description":"","term":"PaaS, Platform as a Service, Platform-as-a-Service"},{"description":"Polyrepo describes an approach of using multiple, independent source code repositories that are independently versioned and controlled.","term":"polyrepo, polyrepos, poly repo, poly repos, poly-repo, poly-repos"},{"description":"Amazon Relational Database Service is a service that makes it easier to set up, operate, and scale a relational database in the cloud. It provides cost-efficient, resizable capacity for an industry-standard relational database and manages common database administration tasks such as backups, restores, and automatic failover.","term":"RDS, Relational Database Service, RDS Aurora"},{"description":"A sub-discipline of software engineering concerned with the compilation, assembly, and delivery of source code into finished products or other software components that are subsequently shipped to production","term":"Release engineering"},{"description":"Amazon S3 is an object storage service with a simple web service interface and API capable of storing and retrieving any amount of data from anywhere on the web. It is designed to deliver 99.999999999% durability, and scale past trillions of objects worldwide.","term":"S3, Amazon S3, Simple Storage Service"},{"description":"An S3 bucket is a logical unit of storage in S3 that stores collections of objects.","term":"s3 bucket, s3 Buckets, s3-buckets, s3-Buckets"},{"description":"S3FS refers both to an application, script and the concept of mounting a remote S3 bucket as a local filesystem.","term":"s3fs, s3-fs, s3 fs, s3 filesystem"},{"description":"A sandbox environment is a place where developers can play around with new technologies without risk of impacting staging or production environments.","term":"Sandbox, sandbox environment, dev environment"},{"description":"Semantic versioning (e.g. 1.0.3) is the most widely adopted scheme for assigning unique version numbers to software releases.","term":"semver, semvers, semantic version, semantic versions, semantic versioning"},{"description":"A contract or agreement offered by a service provider that defines the expected level of service, responsibilities, priorities, and guarantees regarding availability, performance, and other aspects of the service.","term":"sla, service level agreement"},{"description":"/dev/shm` is an ephemeral in-memory filesystem useful for caching temporary files that should not be persisted.","term":"/dev/shm, shm"},{"description":"A container that performs other duties that are related to our main application but shouldn\u0026rsquo;t be directly built into that application.","term":"Sidekick container, Sidekick containers"},{"description":"Amazon Simple Notification Service is a fast, flexible, fully managed push notification service that lets you send individual messages or to fan-out messages to large numbers of recipients.","term":"SNS, Simple Notification service"},{"description":"Single sign-on (SSO) is an authentication system that allows a user to login to multiple applications with one set of credentials.","term":"SSO, Single Signon, Single Sign-on"},{"description":"Slack is a cloud-based service for team collaboration (chat, voice, video, screensharing, etc).","term":"slack"},{"description":"The SDLC describes the process for planning, developing, testing, and deploying an application.","term":"Software Development Lifecycle, SDLC"},{"description":"","term":"SaaS, Software as a Service, Software-as-a-Service"},{"description":"One of the phases in the SDLC whereby software is deployed to an environment. Common stages are “Production”, “Staging”, “QA” or “Development”","term":"Stage, Staging, production, prod, dev"},{"description":"String Interpolation is the process of evaluating a string containing one or more placeholders (e.g. $FOOBAR or {{...}}) and replacing the placeholders with their corresponding values.","term":"Interpolation, String interpolation, Variable interpolation, Variable substitution, Variable expansion"},{"description":"A subject-matter expert (SME) is a person who is an authority (domain expert) in a particular area or topic, which is referred to as the domain such as DevOps, Kubernetes, Terraform, etc.","term":"SME, SMEs, Subject-matter expert, Subject Matter Expertise, Subject Matter Expert, Domain Expert"},{"description":"Synthetic monitoring is a style of monitoring that attempts to closely emulate the behavior of an end-user.","term":"synthetic monitoring"},{"description":"Technical debt represents all the things that need to be redone later due to poor choices or necessary tradeoffs made today.","term":"technical debt, tech debt, code debt, design debt"},{"description":"Every Terraform configuration has at least one module, known as its root module, which consists of the resources defined in the .tf files in the main working directory. Root modules are the terraform configuration that we actually apply and have terraform state.","term":"Terraform, Module, Root Module"},{"description":"This is a common approach to installing various tools via a terminal prompt. You see this commonly done like so: curl example.com/install.sh | bash","term":"curl-bash"},{"description":"This is a SweetOps pattern used to install tooling via a terminal prompt. The primary usage is in Geodesic, which looks like: docker run --rm cloudposse/geodesic:latest-debian | bash -s latest-debian","term":"docker-bash"},{"description":"A topology is the arrangement of various elements (links, nodes, etc.) in a network architecture.","term":"topology, network topology"},{"description":"The ability to run complete, disposable apps on Kubernetes for Staging and Development.","term":"Unlimited Staging Environments"},{"description":"A Virtual Private Cloud is a logically isolated network within in AWS.","term":"VPC, Virtual Private Cloud"},{"description":"Wiki documentation driven operation processes.","term":"WikiOps, Wiki Operations"},{"description":"YAML (or YAML Ain\u0026rsquo;t Markup Language) is a human-readable data-serialization language.","term":"YAML"},{"description":"yq is a Go-based command line tool for YAML that supports standard CRUD operations.","term":"yq"}]